[
  {
    "id": 5,
    "slug": "bnp-puts-younger-faces-forward-for-2026-seat-contest",
    "category": "POLITICS",
    "date": "October 2025",
    "title": "BNP Puts Younger Faces Forward for 2026 Seat Contest",
    "excerpt": "The BNP is selecting a new generation of candidates, emphasising youth, fresh perspective and digital outreach ahead of the 2026 election.",
    "featuredImage": "/news-5.jpg",
    "content": [
      {
        "type": "text",
        "text": "In a move that signals a shift in strategy, the Bangladesh Nationalist Party (BNP) is nominating younger contenders for many constituencies, as part of its plan to modernise and diversify its candidate lineup."
      },
      {
        "type": "text",
        "text": "According to party sources, these younger candidates will be supported by veteran leaders to strengthen grassroots engagement and social-media outreach for the upcoming polls."
      },
      {
        "type": "quote",
        "text": "We need energetic youth who can connect with today's voters and bring new ideas to the table.",
        "author": "Mirza Fakhrul Islam Alamgir, Secretary General, BNP"
      },
      {
        "type": "text",
        "text": "The party also plans training sessions in digital campaign tools and voter-data analytics to equip the fresh faces for success."
      }
    ]
  },
  {
    "id": 6,
    "slug": "bnp-announces-first-phase-candidates-for-200-seats",
    "category": "POLITICS",
    "date": "October 2025",
    "title": "BNP Announces First Phase Candidates for 200 Seats",
    "excerpt": "BNP has released its first-phase candidates for about 200 constituencies and warns internal aspirants to back the chosen nominees fully.",
    "featuredImage": "/news-4.jpg",
    "content": [
      {
        "type": "text",
        "text": "The Bangladesh Nationalist Party (BNP) has unveiled names of candidates for some 200 parliamentary constituencies as part of the first phase of its election preparation, emphasizing unity and discipline within the ranks."
      },
      {
        "type": "text",
        "text": "Party leaders noted that although the process is underway, final nominations will only be confirmed once the election schedule is declared by the authorities."
      },
      {
        "type": "quote",
        "text": "Once we give the green signal, every candidate must get full support from the party — no fragmentation acceptable.",
        "author": "Salahuddin Ahmed, Standing Committee Member, BNP"
      },
      {
        "type": "text",
        "text": "The release is also intended to jump-start campaign preparations, including local organising, candidate briefings and alliance coordination."
      }
    ]
  },
  {
    "id": 7,
    "slug": "bnp-proposes-5-percent-women-candidates-direct-polls",
    "category": "POLITICS",
    "date": "October 2025",
    "title": "BNP Proposes 5 % Women Candidates in Direct Polls",
    "excerpt": "BNP formally proposes that at least 5% of candidates in direct elections be women, signalling its support for gender-balanced nominations.",
    "featuredImage": "/news-3.jpg",
    "content": [
      {
        "type": "text",
        "text": "The Bangladesh Nationalist Party (BNP) has proposed that political parties agree to nominate at least 5 % women candidates for direct elections ahead of the next parliamentary polls."
      },
      {
        "type": "text",
        "text": "BNP leaders argued that this step would enhance democratic inclusivity and increase women's representation in parliament."
      },
      {
        "type": "quote",
        "text": "We believe women have to be more than spectator in politics — they should be decision-makers too.",
        "author": "Salahuddin Ahmed, BNP Standing Committee Member"
      },
      {
        "type": "text",
        "text": "However, critics say 5 % is a modest target given the women's share in the electorate, and they are calling for higher thresholds."
      }
    ]
  },
  {
    "id": 8,
    "slug": "bnp-strong-focus-on-survey-based-candidate-selection",
    "category": "POLITICS",
    "date": "September 2025",
    "title": "BNP Strong Focus on Survey-based Candidate Selection",
    "excerpt": "BNP is using surveys, public reputation data and movement credentials to pick the right candidates for the upcoming election, breaking from older practices.",
    "featuredImage": "/news-2.jpg",
    "content": [
      {
        "type": "text",
        "text": "In a departure from earlier methods, the Bangladesh Nationalist Party (BNP) is increasingly relying on constituency-level surveys, popularity scores and activism credentials when selecting its nominees."
      },
      {
        "type": "text",
        "text": "Local organisations are being asked to submit lists of aspirants, followed by vetting by the Standing Committee and the Parliamentary Board."
      },
      {
        "type": "quote",
        "text": "No longer is seniority alone enough — we want people who deliver, who mobilise, who matter on the ground.",
        "author": "BNP Standing Committee Member"
      },
      {
        "type": "text",
        "text": "The party says this process is meant to reduce internal conflict, accelerate campaign readiness, and ensure competitive candidacies."
      }
    ]
  },
  {
    "id": 9,
    "slug": "bnp-faces-tough-seat-allocation-in-key-divisions",
    "category": "POLITICS",
    "date": "September 2025",
    "title": "BNP Faces Tough Seat Allocation in Key Divisions",
    "excerpt": "Despite early progress, BNP still has major internal battles over seat allocation in several key divisions such as Dhaka and Chittagong.",
    "featuredImage": "/news-1.jpg",
    "content": [
      {
        "type": "text",
        "text": "Even as the Bangladesh Nationalist Party (BNP) moves ahead with candidate announcements, internal rivalries continue to complicate seat-allocation especially in important divisions like Dhaka and Chittagong."
      },
      {
        "type": "text",
        "text": "Multiple aspirants in many constituencies are refusing to back-down, forcing the central leadership to intervene and mediate."
      },
      {
        "type": "quote",
        "text": "If we pursue this fight in public, we lose the seat — so unity must come first.",
        "author": "Senior BNP Leader"
      },
      {
        "type": "text",
        "text": "The party stresses that once a nominee is 'green-lit', all aspirants must publicly support them to avoid fragmentation of the vote."
      }
    ]
  },
  {
  "id": 10,
  "slug": "bnp-form-broad-alliance-ahead-of-2026-polls",
  "category": "POLITICS",
  "date": "October 2025",
  "title": "BNP to Form Broad Alliance Ahead of 2026 Polls",
  "excerpt": "BNP confirms it is negotiating a broad alliance with partner parties to maximise its electoral chance in the upcoming national election.",
  "featuredImage": "/news-6.jpg",
  "content": [
  {
  "type": "text",
  "text": "The Bangladesh Nationalist Party (BNP) is actively negotiating a broader political alliance with other parties to strengthen its hand ahead of the 2026 general election."
  },
  {
  "type": "text",
  "text": "Leaders say this alliance approach will help avoid vote splitting and increase chances of winning competitive seats."
  },
  {
  "type": "quote",
  "text": "Our strength is greater when we stand together — that's why we are looking beyond individual parties.",
  "author": "Salahuddin Ahmed, BNP Standing Committee Member"
  },
  {
  "type": "text",
  "text": "The party hopes to finalise the alliance pact before formal election announcement and begin coordinated campaigning soon."
  }
  ]
  },
  {
    "id": 11,
    "slug": "bnp-launches-digital-campaign-platform",
    "category": "TECHNOLOGY",
    "date": "October 2025",
    "title": "BNP Launches Digital Campaign Platform",
    "excerpt": "BNP unveils a new digital platform to engage voters online, featuring interactive tools and real-time updates for the 2026 election.",
    "featuredImage": "/news-7.jpg",
    "content": [
      {
        "type": "text",
        "text": "The Bangladesh Nationalist Party (BNP) has launched an innovative digital campaign platform designed to modernize voter engagement and streamline election preparations."
      },
      {
        "type": "text",
        "text": "The platform includes features like online voter registration, campaign donation portals, and social media integration for real-time updates."
      },
      {
        "type": "quote",
        "text": "In today's world, politics must meet people where they are — online and on their devices.",
        "author": "Digital Campaign Director, BNP"
      },
      {
        "type": "text",
        "text": "Party officials believe this initiative will help reach younger demographics and provide transparent communication channels."
      }
    ]
  },
  {
    "id": 12,
    "slug": "bnp-hosts-youth-leadership-summit",
    "category": "EVENTS",
    "date": "October 2025",
    "title": "BNP Hosts Youth Leadership Summit",
    "excerpt": "BNP organizes a summit for young leaders to discuss future policies and develop leadership skills ahead of the 2026 elections.",
    "featuredImage": "/news-8.jpg",
    "content": [
      {
        "type": "text",
        "text": "The Bangladesh Nationalist Party (BNP) recently hosted its annual Youth Leadership Summit, bringing together aspiring leaders from across the country."
      },
      {
        "type": "text",
        "text": "The event featured workshops on policy development, public speaking, and campaign strategy, with keynote speeches from senior party members."
      },
      {
        "type": "quote",
        "text": "Our youth are the future of Bangladesh — we must empower them to lead with vision and integrity.",
        "author": "Tarique Rahman, BNP Senior Vice Chairman"
      },
      {
        "type": "text",
        "text": "Participants left the summit with new skills and renewed commitment to democratic values and party principles."
      }
    ]
  },
  {
    "id": 13,
    "slug": "bnp-addresses-economic-policy-concerns",
    "category": "ECONOMY",
    "date": "September 2025",
    "title": "BNP Addresses Economic Policy Concerns",
    "excerpt": "BNP outlines its economic agenda focusing on job creation, inflation control, and sustainable development for the next term.",
    "featuredImage": "/news-9.jpg",
    "content": [
      {
        "type": "text",
        "text": "In response to growing economic challenges, the Bangladesh Nationalist Party (BNP) has unveiled a comprehensive economic policy framework."
      },
      {
        "type": "text",
        "text": "The policy emphasizes job creation through industrial development, inflation control via monetary reforms, and sustainable growth initiatives."
      },
      {
        "type": "quote",
        "text": "Economic stability is the foundation of national progress — we will prioritize policies that create opportunities for all citizens.",
        "author": "Economic Affairs Secretary, BNP"
      },
      {
        "type": "text",
        "text": "The party plans to implement these policies through strategic partnerships with business leaders and international organizations."
      }
    ]
  },
  {
    "id": 14,
    "slug": "bnp-celebrates-independence-day-with-mass-gathering",
    "category": "EVENTS",
    "date": "March 2025",
    "title": "BNP Celebrates Independence Day with Mass Gathering",
    "excerpt": "Thousands gather at BNP's Independence Day celebration, reaffirming commitment to democratic values and national sovereignty.",
    "featuredImage": "/news-10.jpg",
    "content": [
      {
        "type": "text",
        "text": "The Bangladesh Nationalist Party (BNP) marked Bangladesh's Independence Day with a grand mass gathering at its central office in Dhaka."
      },
      {
        "type": "text",
        "text": "Party leaders delivered speeches highlighting the importance of democracy, freedom, and the ongoing struggle for political rights."
      },
      {
        "type": "quote",
        "text": "Independence means nothing without democracy — we will continue to fight for the rights our forefathers secured.",
        "author": "Begum Khaleda Zia, Former Prime Minister"
      },
      {
        "type": "text",
        "text": "The event featured cultural performances, flag hoisting, and distribution of sweets to mark the occasion."
      }
    ]
  },
  {
    "id": 15,
    "slug": "bnp-announces-environmental-protection-initiative",
    "category": "ENVIRONMENT",
    "date": "November 2025",
    "title": "BNP Announces Environmental Protection Initiative",
    "excerpt": "BNP launches comprehensive environmental program focusing on climate change adaptation and sustainable resource management.",
    "featuredImage": "/news-11.jpg",
    "content": [
      {
        "type": "text",
        "text": "Recognizing the urgent need for environmental action, the Bangladesh Nationalist Party (BNP) has announced a major environmental protection initiative."
      },
      {
        "type": "text",
        "text": "The program includes policies for climate change adaptation, renewable energy promotion, and sustainable management of natural resources."
      },
      {
        "type": "quote",
        "text": "Our planet's health is inseparable from our nation's future — we must act now to protect both.",
        "author": "Environmental Policy Coordinator, BNP"
      },
      {
        "type": "text",
        "text": "BNP plans to collaborate with environmental NGOs and international partners to implement these initiatives effectively."
      }
    ]
  }
]
