[
  {
    "id": 5,
    "slug": "bnp-puts-younger-faces-forward-for-2026-seat-contest",
    "category": "POLITICS",
    "date": "October 2025",
    "title": "২০২৬ সালের আসনের জন্য বিএনপি তরুণদের সামনে তুলে ধরছে",
    "excerpt": "The BNP is selecting a new generation of candidates, emphasising youth, fresh perspective and digital outreach ahead of the 2026 election.",
    "featuredImage": "/news-5.jpg",
    "content": [
      {
        "type": "text",
        "text": "কৌশলগত পরিবর্তনের ইঙ্গিতবাহী এই পদক্ষেপে, বাংলাদেশ জাতীয়তাবাদী দল (বিএনপি) তাদের প্রার্থী তালিকাকে আধুনিকীকরণ এবং বৈচিত্র্যময় করার পরিকল্পনার অংশ হিসেবে অনেক নির্বাচনী এলাকায় তরুণ প্রার্থীদের মনোনয়ন দিচ্ছে।"
      },
      {
        "type": "text",
        "text": "দলীয় সূত্র অনুসারে, আসন্ন নির্বাচনের জন্য তৃণমূল পর্যায়ের সম্পৃক্ততা এবং সামাজিক যোগাযোগ মাধ্যমের প্রচারণা জোরদার করার জন্য এই তরুণ প্রার্থীদের অভিজ্ঞ নেতারা সমর্থন করবেন।"
      },
      {
        "type": "quote",
        "text": "We need energetic youth who can connect with today's voters and bring new ideas to the table.",
        "author": "Mirza Fakhrul Islam Alamgir, Secretary General, BNP"
      },
      {
        "type": "text",
        "text": "সাফল্যের জন্য নতুন মুখদের প্রস্তুত করার জন্য দলটি ডিজিটাল প্রচারণার সরঞ্জাম এবং ভোটার-তথ্য বিশ্লেষণের প্রশিক্ষণ সেশনের পরিকল্পনাও করেছে।"
      }
    ]
  },
  {
    "id": 6,
    "slug": "bnp-announces-first-phase-candidates-for-200-seats",
    "category": "POLITICS",
    "date": "October 2025",
    "title": "BNP Announces First Phase Candidates for 200 Seats",
    "excerpt": "BNP has released its first-phase candidates for about 200 constituencies and warns internal aspirants to back the chosen nominees fully.",
    "featuredImage": "https://www.tbsnews.net/sites/default/files/styles/big_3/public/images/2023/07/22/fakhrul.jpg",
    "content": [
      {
        "type": "text",
        "text": "The Bangladesh Nationalist Party (BNP) has unveiled names of candidates for some 200 parliamentary constituencies as part of the first phase of its election preparation, emphasizing unity and discipline within the ranks."
      },
      {
        "type": "text",
        "text": "Party leaders noted that although the process is underway, final nominations will only be confirmed once the election schedule is declared by the authorities."
      },
      {
        "type": "quote",
        "text": "Once we give the green signal, every candidate must get full support from the party — no fragmentation acceptable.",
        "author": "Mirza Fakhrul Islam Alamgir, secretary general, BNP"
      },
      {
        "type": "text",
        "text": "The release is also intended to jump-start campaign preparations, including local organising, candidate briefings and alliance coordination."
      }
    ]
  },
  {
    "id": 7,
    "slug": "bnp-proposes-5-percent-women-candidates-direct-polls",
    "category": "POLITICS",
    "date": "September 2025",
    "title": "ঠাকুরগাঁও জেলা বিএনপির সভাপতি মির্জা ফয়সল আমিন",
    "excerpt": "BNP formally proposes that at least 5% of candidates in direct elections be women, signalling its support for gender-balanced nominations.",

    "featuredImage": "https://media.prothomalo.com/prothomalo-bangla%2F2025-09-08%2Fs0mkqc3d%2FWhatsApp-Image-2025-09-08-at-7.54.jpg?w=622&auto=format%2Ccompress&fmt=avif",
    "content": [
      {
        "type": "text",
        "text": "প্রায় আট বছর পর ঠাকুরগাঁও জেলা বিএনপির দ্বিবার্ষিক সম্মেলন হয়েছে। এতে বিনা প্রতিদ্বন্দ্বিতায় সভাপতি পদে মির্জা ফয়সল আমিন এবং প্রতিদ্বন্দ্বিতায় সাধারণ সম্পাদক পদে পয়গাম আলী নির্বাচিত হয়েছেন। আজ সোমবার ঠাকুরগাঁও সরকারি বালক উচ্চবিদ্যালয়ের বড় মাঠে ভোট গ্রহণের পর বিকেলে বিজয়ীদের নাম ঘোষণা করেন জেলা বিএনপির সম্মেলনের প্রধান নির্বাচন কমিশনার বদিউজ্জামান চৌধুরী।"
      },
      {
        "type": "text",
        "text": "গত ১৮ আগস্ট জেলা বিএনপির এক সভায় ৮ সেপ্টেম্বর সম্মেলন আয়োজনের সিদ্ধান্ত হয়। সভায় সম্মেলনে কেউ প্রার্থী হতে পারবেন না বলেও জানানো হয়। তবে পরে সেই সিদ্ধান্ত থেকে সরে আসে দলটি। গোপন ব্যালটে নেতৃত্ব বাছাইয়ে গত ৩০ আগস্ট তফসিল ঘোষণা করেন জেলা বিএনপির সম্মেলনের প্রধান নির্বাচন কমিশনার বদিউজ্জামান চৌধুরী। তফসিল অনুযায়ী গত ৪ আগস্ট ছিল মনোনয়নপত্র জমা দেওয়ার শেষ দিন। বিএনপির গঠনতন্ত্রে জেলা কমিটি ১৫১ জনের অনূর্ধ্ব হলেও ওই দিন ৫টি পদের বিপরীতে ১১ জন মনোনয়নপত্র জমা দেন।"
      },
      {
        "type": "quote",
        "text": "সভাপতি পদে বিএনপির মহাসচিব মির্জা ফখরুল ইসলাম আলমগীরের ছোট ভাই মির্জা ফয়সল আমিন বিনা প্রতিদ্বন্দ্বিতায় নির্বাচিত হন। সাধারণ সম্পাদক নির্বাচিত হন পয়গাম আলী।",
        "author": ""
      },
      {
        "type": "text",
        "text": "সাধারণ সম্পাদক পদে জেলা বিএনপির সহসভাপতি ওবায়দুল্লাহ মাসুদ, আল মামুন আলম, যুগ্ম সাধারণ সম্পাদক পয়গাম আলী এবং পৌর বিএনপির সভাপতি শরিফুল ইসলাম মনোনয়নপত্র জমা দেন। যুগ্ম সাধারণ সম্পাদক পদে সাবেক কমিটির সহসভাপতি মুরাদ হোসেন, যুগ্ম সাধারণ সম্পাদক আনছারুল হক ও সাংগঠনিক সম্পাদক আবু হাসান মো. আবদুল হান্নান মনোনয়নপত্র জমা দেন। সাংগঠনিক সম্পাদক পদে মনোনয়নপত্র জমা দেন সাবেক কমিটির সাংগঠনিক সম্পাদক মো. জাফরুল্লাহ ও সত্যজিৎ কুমার কুণ্ডু। প্রচার সম্পাদক পদে প্রার্থী হয়েছিলেন জেলা বিএনপির সমাজসেবা–বিষয়ক সম্পাদক আমিনুল ইসলাম।"
      }
    ]
  },
  {
    "id": 8,
    "slug": "bnp-strong-focus-on-survey-based-candidate-selection",
    "category": "POLITICS",
    "date": "September 2025",
    "title": "জরিপ-ভিত্তিক প্রার্থী নির্বাচনের উপর বিএনপির জোরালো মনোযোগ",
    "excerpt": "বিএনপি জরিপ, জনসাধারণের সুনামের তথ্য এবং আন্দোলনের প্রমাণপত্রাদি ব্যবহার করে আসন্ন নির্বাচনের জন্য সঠিক প্রার্থী নির্বাচন করছে, পুরনো রীতি ভেঙে।",
    "featuredImage": "/news-3.jpg",
    "content": [
      {
        "type": "text",
        "text": "পূর্ববর্তী পদ্ধতি থেকে সরে এসে, বাংলাদেশ জাতীয়তাবাদী দল (বিএনপি) তাদের মনোনীত প্রার্থীদের নির্বাচনের সময় ক্রমবর্ধমানভাবে নির্বাচনী এলাকা-স্তরের জরিপ, জনপ্রিয়তার স্কোর এবং সক্রিয়তার প্রমাণপত্রের উপর নির্ভর করছে।"
      },
      {
        "type": "text",
        "text": "স্থানীয় সংস্থাগুলিকে প্রার্থীদের তালিকা জমা দিতে বলা হচ্ছে, তারপরে স্থায়ী কমিটি এবং সংসদীয় বোর্ড যাচাই-বাছাই করবে।"
      },
      {
        "type": "quote",
        "text": "No longer is seniority alone enough — we want people who deliver, who mobilise, who matter on the ground.",
        "author": "BNP Standing Committee Member"
      },
      {
        "type": "text",
        "text": "দলটি বলছে যে এই প্রক্রিয়াটি অভ্যন্তরীণ দ্বন্দ্ব কমাতে, প্রচারণার প্রস্তুতি ত্বরান্বিত করতে এবং প্রতিযোগিতামূলক প্রার্থীতা নিশ্চিত করতে।"
      }
    ]
  },
  {
    "id": 9,
    "slug": "bnp-faces-tough-seat-allocation-in-key-divisions",
    "category": "POLITICS",
    "date": "September 2025",
    "title": "BNP Faces Tough Seat Allocation in Key Divisions",
    "excerpt": "Despite early progress, BNP still has major internal battles over seat allocation in several key divisions such as Dhaka and Chittagong.",
    "featuredImage": "/news-1.jpg",
    "content": [
      {
        "type": "text",
        "text": "Even as the Bangladesh Nationalist Party (BNP) moves ahead with candidate announcements, internal rivalries continue to complicate seat-allocation especially in important divisions like Dhaka and Chittagong."
      },
      {
        "type": "text",
        "text": "Multiple aspirants in many constituencies are refusing to back-down, forcing the central leadership to intervene and mediate."
      },
      {
        "type": "quote",
        "text": "If we pursue this fight in public, we lose the seat — so unity must come first.",
        "author": "Senior BNP Leader"
      },
      {
        "type": "text",
        "text": "The party stresses that once a nominee is 'green-lit', all aspirants must publicly support them to avoid fragmentation of the vote."
      }
    ]
  },
  {
  "id": 10,
  "slug": "bnp-form-broad-alliance-ahead-of-2026-polls",
  "category": "POLITICS",
  "date": "October 2025",
  "title": "BNP to Form Broad Alliance Ahead of 2026 Polls",
  "excerpt": "BNP confirms it is negotiating a broad alliance with partner parties to maximise its electoral chance in the upcoming national election.",
  "featuredImage": "/news-6.jpg",
  "content": [
  {
  "type": "text",
  "text": "The Bangladesh Nationalist Party (BNP) is actively negotiating a broader political alliance with other parties to strengthen its hand ahead of the 2026 general election."
  },
  {
  "type": "text",
  "text": "Leaders say this alliance approach will help avoid vote splitting and increase chances of winning competitive seats."
  },
  {
  "type": "quote",
  "text": "Our strength is greater when we stand together — that's why we are looking beyond individual parties.",
  "author": "Salahuddin Ahmed, BNP Standing Committee Member"
  },
  {
  "type": "text",
  "text": "The party hopes to finalise the alliance pact before formal election announcement and begin coordinated campaigning soon."
  }
  ]
  },
  {
    "id": 11,
    "slug": "bnp-launches-digital-campaign-platform",
    "category": "TECHNOLOGY",
    "date": "November 2025",
    "title": "৭ নভেম্বর উপলক্ষে বিএনপির কর্মসূচি ঘোষণা: মির্জা ফখরুল ",
    "excerpt": "BNP unveils a new digital platform to engage voters online, featuring interactive tools and real-time updates for the 2026 election.",
    "featuredImage": "https://media.prothomalo.com/prothomalo-bangla%2F2025-11-02%2Fgj682l93%2FBNP.jpeg?rect=187%2C0%2C1350%2C900&w=622&auto=format%2Ccompress&fmt=avif",
    "content": [
      {
        "type": "text",
        "text": "৭ নভেম্বর জাতীয় বিপ্লব ও সংহতি দিবস উপলক্ষে কর্মসূচি ঘোষণা করেছে বিএনপি। দিবসটি উপলক্ষে ৫ থেকে ১৩ নভেম্বর পর্যন্ত নানা কর্মসূচি পালন করবে দলটি। আজ রোববার দুপুরে রাজধানীর নয়াপল্টনে বিএনপির কেন্দ্রীয় কার্যালয়ে দলের মহাসচিব মির্জা ফখরুল ইসলাম আলমগীরের সভাপতিত্বে অনুষ্ঠিত যৌথ সভা শেষে এই কর্মসূচি ঘোষণা করা হয়।"
      },
      {
        "type": "text",
        "text": "যৌথ সভা শেষে জানানো হয়, ৭ নভেম্বর সকাল ছয়টায় নয়াপল্টনে বিএনপির কেন্দ্রীয় কার্যালয়সহ সারা দেশে বিএনপির কার্যালয়গুলোয় দলীয় পতাকা উত্তোলন করা হবে। সকাল ১০টায় জাতীয় নেতাসহ সব পর্যায়ের নেতা–কর্মী সাবেক রাষ্ট্রপতি জিয়াউর রহমানের কবরে পুষ্পস্তবক অর্পণ ও ফাতিহা পাঠ করবেন। দিবসটি উপলক্ষে একই দিন বেলা তিনটায় নয়াপল্টনে বিএনপির কেন্দ্রীয় কার্যালয়ের সামনে থেকে র‍্যালি বের করা হবে। এর আয়োজক ঢাকা মহানগর উত্তর ও দক্ষিণ বিএনপি। সারা দেশের জেলা ও উপজেলা পর্যায়েও একই দিন বিএনপির উদ্যোগে র‍্যালি আয়োজন করা হবে।"
      },
      {
        "type": "quote",
        "text": "৭ নভেম্বর বাংলাদেশের ইতিহাসে এক গুরুত্বপূর্ণ অধ্যায়। জাতিকে ঐক্যবদ্ধ করে স্বাধীনতার চেতনা ও জাতীয় সংহতির প্রতীক হিসেবে এ দিবসের গুরুত্ব আজও অনস্বীকার্য।",
        "author": " মির্জা ফখরুল ইসলাম আলমগীর"
      },
      {
        "type": "text",
        "text": "৬ থেকে ১৩ নভেম্বর পর্যন্ত ৭ নভেম্বরের তাৎপর্য তুলে ধরে ডকুমেন্টারি (ভিডিও ও স্থিরচিত্র) সামাজিক যোগাযোগমাধ্যম, অনলাইন, ইলেকট্রনিক ও প্রিন্ট মিডিয়ায় প্রচার করা হবে। একই সঙ্গে দিবসটি উপলক্ষে পোস্টার ও ক্রোড়পত্র প্রকাশ করবে বিএনপি।"
      }
    ]
  },
  {
    "id": 12,
    "slug": "bnp-hosts-youth-leadership-summit",
    "category": "EVENTS",
    "date": "October 2025",
    "title": "BNP Hosts Youth Leadership Summit",
    "excerpt": "BNP organizes a summit for young leaders to discuss future policies and develop leadership skills ahead of the 2026 elections.",
    "featuredImage": "https://media.prothomalo.com/prothomalo-bangla%2F2025-09-08%2F3tqh961j%2FWhatsApp-Image-2025-09-08-at-7.54.18-PM.jpeg?rect=149%2C0%2C1350%2C900&w=622&auto=format%2Ccompress&fmt=avif",
    "content": [
      {
        "type": "text",
        "text": "The Bangladesh Nationalist Party (BNP) recently hosted its annual Youth Leadership Summit, bringing together aspiring leaders from across the country."
      },
      {
        "type": "text",
        "text": "The event featured workshops on policy development, public speaking, and campaign strategy, with keynote speeches from senior party members."
      },
      {
        "type": "quote",
        "text": "Our youth are the future of Bangladesh — we must empower them to lead with vision and integrity.",
        "author": "Tarique Rahman, BNP Senior Vice Chairman"
      },
      {
        "type": "text",
        "text": "Participants left the summit with new skills and renewed commitment to democratic values and party principles."
      }
    ]
  },
  {
    "id": 13,
    "slug": "bnp-addresses-economic-policy-concerns",
    "category": "ECONOMY",
    "date": "September 2025",
    "title": "BNP Addresses Economic Policy Concerns",
    "excerpt": "BNP outlines its economic agenda focusing on job creation, inflation control, and sustainable development for the next term.",
    "featuredImage": "/news-9.jpg",
    "content": [
      {
        "type": "text",
        "text": "In response to growing economic challenges, the Bangladesh Nationalist Party (BNP) has unveiled a comprehensive economic policy framework."
      },
      {
        "type": "text",
        "text": "The policy emphasizes job creation through industrial development, inflation control via monetary reforms, and sustainable growth initiatives."
      },
      {
        "type": "quote",
        "text": "Economic stability is the foundation of national progress — we will prioritize policies that create opportunities for all citizens.",
        "author": "Economic Affairs Secretary, BNP"
      },
      {
        "type": "text",
        "text": "The party plans to implement these policies through strategic partnerships with business leaders and international organizations."
      }
    ]
  },
  {
    "id": 14,
    "slug": "bnp-celebrates-independence-day-with-mass-gathering",
    "category": "EVENTS",
    "date": "March 2025",
    "title": "BNP Celebrates Independence Day with Mass Gathering",
    "excerpt": "Thousands gather at BNP's Independence Day celebration, reaffirming commitment to democratic values and national sovereignty.",
    "featuredImage": "/news-10.jpg",
    "content": [
      {
        "type": "text",
        "text": "The Bangladesh Nationalist Party (BNP) marked Bangladesh's Independence Day with a grand mass gathering at its central office in Dhaka."
      },
      {
        "type": "text",
        "text": "Party leaders delivered speeches highlighting the importance of democracy, freedom, and the ongoing struggle for political rights."
      },
      {
        "type": "quote",
        "text": "Independence means nothing without democracy — we will continue to fight for the rights our forefathers secured.",
        "author": "Begum Khaleda Zia, Former Prime Minister"
      },
      {
        "type": "text",
        "text": "The event featured cultural performances, flag hoisting, and distribution of sweets to mark the occasion."
      }
    ]
  },
  {
    "id": 15,
    "slug": "bnp-announces-environmental-protection-initiative",
    "category": "ENVIRONMENT",
    "date": "November 2025",
    "title": "BNP Announces Environmental Protection Initiative",
    "excerpt": "BNP launches comprehensive environmental program focusing on climate change adaptation and sustainable resource management.",
    "featuredImage": "/news-11.jpg",
    "content": [
      {
        "type": "text",
        "text": "Recognizing the urgent need for environmental action, the Bangladesh Nationalist Party (BNP) has announced a major environmental protection initiative."
      },
      {
        "type": "text",
        "text": "The program includes policies for climate change adaptation, renewable energy promotion, and sustainable management of natural resources."
      },
      {
        "type": "quote",
        "text": "Our planet's health is inseparable from our nation's future — we must act now to protect both.",
        "author": "Environmental Policy Coordinator, BNP"
      },
      {
        "type": "text",
        "text": "BNP plans to collaborate with environmental NGOs and international partners to implement these initiatives effectively."
      }
    ]
  }
]
